import Button from "../components/button/Button";
import FAQItem from "../components/questions/Questions"
import styles from "./ThirdScreen.module.css"

const ThirdScreen = () => {
  return (
    <>
      <div className={styles.title}>שאלות נפוצות</div>
      <div className={styles.description}>אני בטוחה שיש לך כמה שאלות שאת חייבת לקבל עליהן תשובה עכשיו.. ארגנתי עבורך מקבץ שאלות שקיבלתי לאחרונה - תלחצי על השאלה והתשובה תפתח :)</div>
      
      <FAQItem 
        question="כמה זמן לוקח איפור ושיער ביום החתונה?" 
        answer="איפור כלה לוקח כשעה וחצי, ותסרוקת כלה בין שעה לשעתיים. בסך הכל, חבילת איפור ושיער יחד לוקחת כשעתיים לכלה רגילה ועד שלוש וחצי שעות לכלה עם צרכים מיוחדים. הכל מתוכנן בקפידה כדי שתרגישי רגועה ולא בלחץ זמן ביום החשוב שלך."
      />
      
      <FAQItem 
        question="אני עם עור אקנטי/פוסט אקנה, האם זו בעיה?" 
        answer="ממש לא! אני מתמחה בעור עם אקנה, פוסט אקנה וצלקות. גם אני עצמי התמודדתי עם אקנה ופוסט אקנה, מה שהוביל אותי להתמחות בתחום. אני יודעת לאפר את סוג העור שלך כמו שהוא, בלי להסתיר אותך מאחורי שכבות כבדות של איפור, תוך יצירת מראה טבעי וקליל עם עמידות מקסימלית. אפילו אתן לך המלצות למוצרי איפור שיעזרו לך להתאפר בטבעיות גם ביום יום!"
      />
      
      <FAQItem 
        question="האם את עושה גם איפור מלוות?" 
        answer="זה מאוד תלוי בזמנים ובעונות. אני מתמקדת בכלה אחת ביום כדי לתת לה את מלוא תשומת הלב שהיא ראויה לה. שלחי לי הודעה ונבדוק יחד את האפשרויות הקיימות לגבי המלוות שלך."
      />
      
      <FAQItem 
        question="יש לי שיער מתולתל, האם זה יכול להוות בעיה לתסרוקת?" 
        answer="ממש לא! אני יודעת לעבוד עם כל סוגי השיער, כולל שיער מתולתל. אני משתמשת בטכניקה מיוחדת שמבטיחה שהתסרוקת תישאר יציבה ועמידה לאורך כל היום והלילה. בנוסף, יש אפשרות לשלב תוספות שיער שמגבירות את העמידות המקסימלית של התסרוקת."
      />
      
      <FAQItem 
        question="אני מפחדת שהאיפור יהיה מוגזם, איך אני יכולה להיות בטוחה שאקבל את המראה שאני רוצה?" 
        answer="הבנתי לגמרי את החשש שלך! לכן התהליך איתי כולל שיחת ייעוץ מקדימה בה אנחנו מבינות איזה סוג תסרוקת ואיפור את מחפשת, ואיפור ושיער ניסיון כחודש לפני החתונה. אנחנו מתאמות ציפיות ואני נותנת את הדעה המקצועית שלי לפי סוג העור שלך. אם משהו לא מסתדר, אנחנו מתאימות את הנראות עד שאת מרגישה סגורה 100% על המראה הסופי."
      />
      
      <FAQItem 
        question="כמה זמן האיפור והתסרוקת יחזיקו מעמד?" 
        answer="האיפור יחזיק לך לאורך כל היום עד שתורידי אותו (תלוי כמובן בסוג העור). התסרוקת לא זזה - אני עובדת בטכניקה מיוחדת שמייצרת תסרוקת יציבה ועמידה לאורך כל האירוע. בנוסף, אני מגיעה לטאצ'אפים לפני/אחרי החופה כדי לוודא שהכל מושלם!"
      />
      
      <FAQItem 
        question="האם איפור כלות כולל ריסים? ומה לגבי תוספות שיער?" 
        answer="כן, איפור כלות כולל ריסים. לגבי תוספות שיער - לכלות הן כלולות במחיר החבילה, ולאיפור ערב הן בתשלום נוסף. בשמחה אתן לך את כל הפרטים הספציפיים כשנדבר."
      />
      
      <FAQItem 
        question="כמה זמן מראש צריך לשריין תור?" 
        answer="אני ממליצה לשריין תור ברגע שיש לך תאריך, כדי שלא תצטרכי להתפשר על השעות שלך או על המאפרת והמסרקת שלך בגלל שאולי הן כבר תפוסות. אני עובדת עם כלה אחת ביום כדי להבטיח שאתן לה את מלוא תשומת הלב, לכן התאריכים מתמלאים מהר."
      />
      
      <FAQItem 
        question="האם יש דברים שאני צריכה לעשות לפני האירוע כהכנה?" 
        answer="בהחלט! כחלק מהתהליך, אני נותנת הוראות טיפוח מפורטות - מה לעשות ומה לא לעשות לפני החתונה עם העור שלך. למשל, המלצות לגבי כמה זמן לפני לעשות טיפולים בפנים או שעווה. ומבחינת השיער - מתי לחפוף, איך לחפוף, המלצות לגבי גוונים וצבעים, וכו'. כל ההנחיות נועדו להבטיח תוצאה מושלמת ביום האירוע."
      />
      <Button text="יש לי עוד שאלה קטנה"/>
    </>
  );
}

export default ThirdScreen